---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CondenserWaterLoopId
source: html/47f543fc-aab9-aa58-c350-05cf3d896426.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CondenserWaterLoopId Property

The condenser water loop used for the direction expansion water cooled option of cooling coil.

## Syntax (C#)
```csharp
public ElementId CondenserWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null